Gizmodo/Aqua-Controller-based-on-ESP8266/src/Main.cpp
void setCurrentState(boolean state, const String& name) {
    // TODO Посмотреть
    // String stateString = state ? "ON" : "OFF";
    if (name == "Компрессор") {
        //"on=13:22#off=23:54#e=1#s=1#p=12"
        /*
         char buff[50];
         snprintf(buff, sizeof(buff), "on=%02d:%02d#off=%02d:%02d#e=%d#s=%d#p=%d", air.led.HOn, air.led.MOn, air.led.HOff,
                  air.led.MOff, air.led.enabled, state, air.led.pin);
         std::string buffAsStdStr = buff;
         */
    } else {
        // TODO Отправка нового состояния на backend
        /*
        if (!Firebase.setBool(data, pathLight + name + "/state", state)) {
            Serial.printf_P(PSTR("Не удалось установить состояние прожектора %s в %s\n"), name.c_str(), stateString.c_str());
        } else {
            Serial.printf_P(PSTR("Состояние прожектора %s установлено в %s\n"), name.c_str(), stateString.c_str());
        }
        */
    }
}

void putUptime(const String& uptime) {
    char* url = nullptr;
    url = _getPGMString(urlPutUptime);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"uptime\":\"" + uptime + "\"}";
        https.addHeader(String(_getPGMString(contentType)), String(_getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("putUptime() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "putUptime() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void uptime() {
    String uptime = uptime_formatter::getUptime();
    Serial.printf_P(PSTR("Время работы устройства: %s\n"), uptime.c_str());
    putUptime(uptime);
}

void putLastOnline(const String& currentTime) {
    char* url = nullptr;
    url = _getPGMString(urlPutLastOnline);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"lastonline\":\"" + currentTime + "\"}";
        https.addHeader(String(_getPGMString(contentType)), String(_getPGMString(applicationJson)));
        int httpCode = https.PUT(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("postLastOnline() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postLastOnline() -> Невозможно подключиться\n");
    }
    delPtr(url);
}

void lastOnline() {
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    String payload = String(currentTime);
    putLastOnline(payload);
    free(currentTime);
}

void postBoot() {
    char* url = nullptr;
    char* currentTime = clockRTC.dateFormat("H:i:s d.m.Y", clockRTC.getDateTime());
    url = _getPGMString(urlPostBoot);
    if (https.begin(*client, String(url))) {
        String payload;
        payload = "{\"time\":\"" + String(currentTime) + "\"}";
        https.addHeader(String(_getPGMString(contentType)), String(_getPGMString(applicationJson)));
        int httpCode = https.POST(payload);
        if ((httpCode > 0) && (httpCode == HTTP_CODE_OK || httpCode == HTTP_CODE_MOVED_PERMANENTLY)) {
        } else {
            Serial.printf_P(PSTR("postBoot() -> Ошибка: %s\n"), HTTPClient::errorToString(httpCode).c_str());
        }
        https.end();
    } else {
        Serial.printf_P(PSTR("%s\n"), "postBoot() -> Невозможно подключиться\n");
    }
    delPtr(url);
    String message;
    message = "Перезагрузка " + String(currentTime);
    sendMessage(message);
    message.clear();
}

void timer1() {
    ledState_t currentLed;
    char* df = clockRTC.dateFormat("H:i:s", clockRTC.getDateTime());
    Serial.printf_P(PSTR("Сейчас %s\n"), String(df).c_str());
    free(df);

    /*
     getTemperature();
     checkUpdateSettings();
     if (shouldUpdateFlag) {
         readOptionsFirebase();
         printAll();
         shouldUpdateFlag = false;
     }
     */
    while (!vectorState.empty()) {
        currentLed = vectorState.back();
        setCurrentState(currentLed.state, currentLed.name);
        vectorState.pop_back();
    }
    vectorState.clear();
}

void timer5() {
    uptime();
    lastOnline();
}

void startTimers() {
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные", Alarm.count());
    Alarm.timerRepeat(5 * 60, timer5);
    Alarm.timerRepeat(60, timer1);
    Serial.printf_P(PSTR("%s -> %d\n"), "Таймеры: основные и прожекторные", Alarm.count());
}

void setup() {
    Serial.begin(115200);
    Serial.println();

    //  getTemperature();
    initRealTimeClock();
    initLedsArray();
    initDosersArray();
    initCompressor();

    if (!initWiFi()) {
        getParamsEEPROM();
    } else {
        initHTTPClient();
        postBoot();
        getParamsBackEnd();
        syncTime();
        setInternalClock();
        // printAll();
    }

    startTimers();
    timer5();
}

// TODO Добавить вывод информации по устройствам
// TODO Чтение температуры
// TODO EEPROM чтение и запись

void loop() {
    Alarm.delay(10);
}